/*দুটি গ্যাংস্টার আছে – Harry এবং Larry।
ওরা মিলে মোট x টি ক্যান নষ্ট করেছে।
ইনপুট হিসেবে দেওয়া থাকে:
a = Harry কত ক্যান নষ্ট করেছে
b = Larry কত ক্যান নষ্ট করেছে

কিন্তু আউটপুটে দেখাতে হবে:
Harry যদি সবটা Larry করত এবং Larry যদি সবটা Harry করত তাহলে কত ক্যান নষ্ট হত!

➡ অর্থাৎ Harry এর জন্য আউটপুট হবে (Larry এর ক্যান)
➡ Larry এর জন্য আউটপুট হবে (Harry এর ক্যান)

কিন্তু Problem এ একটা টুইস্ট আছে —
তারা যখন গুলি করেছে, এক ক্যান দুজন মিলে লাগিয়েছে।
তাই মোট থেকে এক কমিয়ে নিতে হয়।   

Formula:
Harry new=b-1
Larry new=a-1
*/
#include <iostream>
using namespace std;

int main()
{
    int a, b;
    cin >> a >> b;
    cout << b - 1 << " " << a - 1;
    
}
